package solver.approximation.samples

object Samples {
  val functions = List(
    "12*x/(x^4+1)",
    "15*x/(x^4+2)",
    "4*x/(x^4+3)",
    "15*x/(x^4+4)",
    "6*x/(x^4+5)",
    "12*x/(x^4+6)",
    "23*x/(x^4+7)",
    "3*x/(x^4+8)",
    "4*x/(x^4+9)",
    "18*x/(x^4+10)",
    "5*x/(x^4+11)",
    "4*x/(x^4+12)",
    "31*x/(x^4+13)",
    "25*x/(x^4+14)",
    "4*x/(x^4+15)",
    "17*x/(x^4+16)",
    "2*x/(x^4+17)",
    "30*x/(x^4+18)",
    "5*x/(x^4+19)",
    "11*x/(x^4+20)",
    "14*x/(x^4+21)",
    "5*x/(x^4+22)",
    "16*x/(x^4+23)",
    "7*x/(x^4+24)",
    "28*x/(x^4+25)",
    "7*x/(x^4+26)",
    "18*x/(x^4+27)",
    "21*x/(x^4+28)"
  )

  val approximators = List (
  "Кубическая",
  "Линейная",
  "Полиномиальная 2-й степени",
  "Полиномиальная 3-й степени",
  "Экспоненциальная",
  "Логарифмическая",
  "Степенную"
  )
}